#Условие:
#Напишите программу, которая выводит случайное число в интервале от 1 до 10 (включительно). 

import random

x = random.randint(1,10)

print(x)
