#Условие:
#Напишите программу, которая выводит случайное дробное число в интервале от 1 до 10 (включительно)

import random

x = random.uniform(1,10)

print(x)
